;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; Themes
(package! acme-theme)
(package! nezburn-theme)

;; Treemacs
(package! treemacs)

;; Icons
(package! all-the-icons)

;; Code check + lsp
(package! lsp-mode)
(package! auto-complete)
(package! corfu)
(package! flycheck-phpstan)
(package! flycheck-php-noverify)
(package! flycheck-ocaml)
(package! flycheck-crystal)
(package! flycheck-julia)
(package! flycheck-clojure)
(package! flycheck-elixir)
(package! flycheck-rust)
(package! projectile)
(package! crystal-mode)
(package! elixir-mode)
(package! clojure-mode)
(package! php-mode)
